InformationRegisters/ПорядокПереводаСтатусаЛида.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ПорядокПереводаСтатусаЛида</Name>
			<Comment>#6305</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Разрешено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТекущийСтатус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыЛида</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СледующийСтатус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыЛида</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/СтатусыЛида.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>СтатусыЛида</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Использовать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитДопУпорядочивания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ПорядокПереводаСтатусаЛида/Forms/ФормаРедактированияПравил/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	СформироватьПодменюКомандЗаполнения();
	
	РегистрыСведений.ПорядокПереводаСтатусаЛида.ЗаполнитьНастройкиПоУмолчанию(Ложь);
	ЗаполнитьТекущиеСтатусы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПодключитьОбработчикОжидания("ТаблицаТекущихСтатусовПриАктивизацииСтрокиОбработчикОжидания", 0.1, Истина);
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ТаблицаТекущихСтатусовПриАктивизацииСтроки(Элемент)
	ПодключитьОбработчикОжидания("ТаблицаТекущихСтатусовПриАктивизацииСтрокиОбработчикОжидания", 0.1, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаТекущихСтатусовПриАктивизацииСтрокиОбработчикОжидания()
	
	ТаблицаСледующихСтатусов.Очистить();
	ТекущиеДанные = Элементы.ТаблицаТекущихСтатусов.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено ТОгда
		Возврат;
	КонецЕсли;
	
	ИнформацияПоПравилам = ПолучитьИнформациюПоПравилам(ТекущиеДанные.ТекущийСтатус);
	
	Для каждого СтрокаПравила из ИнформацияПоПравилам Цикл
		НоваяСтрока = ТаблицаСледующихСтатусов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаПравила);
	КонецЦикла;	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТекущиеСтатусы()
	
	Результат = Новый Массив;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СтатусыЛида.Ссылка КАК ТекущийСтатус,
	|	СтатусыЛида.Использовать КАК Использовать
	|ИЗ
	|	Справочник.СтатусыЛида КАК СтатусыЛида
	|ГДЕ
	|	НЕ СтатусыЛида.ПометкаУдаления
	//#11332
	|	И НЕ СтатусыЛида.Ссылка = ЗНАЧЕНИЕ(Справочник.СтатусыЛида.УДАЛИТЬ_Сервис)
	|	И НЕ СтатусыЛида.Ссылка = ЗНАЧЕНИЕ(Справочник.СтатусыЛида.УДАЛИТЬ_Рекламация)
	|
	|УПОРЯДОЧИТЬ ПО
	|	СтатусыЛида.РеквизитДопУпорядочивания";
		
	ТаблицаТекущихСтатусов.Загрузить(Запрос.Выполнить().Выгрузить());
		
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьИнформациюПоПравилам(ТекущийСтатус)
	
	Результат = Новый Массив;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПорядокПереводаСтатусаЛида.СледующийСтатус КАК СледующийСтатус,
	|	ПорядокПереводаСтатусаЛида.Разрешено КАК Разрешено,
	|	ПорядокПереводаСтатусаЛида.СледующийСтатус.Использовать КАК Использовать
	|ИЗ
	|	РегистрСведений.ПорядокПереводаСтатусаЛида КАК ПорядокПереводаСтатусаЛида
	|ГДЕ
	|	ПорядокПереводаСтатусаЛида.ТекущийСтатус = &ТекущийСтатус
	|	И НЕ ПорядокПереводаСтатусаЛида.СледующийСтатус = &ТекущийСтатус
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПорядокПереводаСтатусаЛида.СледующийСтатус.РеквизитДопУпорядочивания";
	
	Запрос.УстановитьПараметр("ТекущийСтатус", ТекущийСтатус);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Результат.Добавить(Новый Структура("СледующийСтатус, Разрешено, Использовать", Выборка.СледующийСтатус, Выборка.Разрешено, Выборка.Использовать));	
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура СформироватьПодменюКомандЗаполнения()

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПРЕДСТАВЛЕНИЕ(СтатусыЛида.Ссылка) КАК Статус,
	|	СтатусыЛида.ИмяПредопределенныхДанных КАК Имя
	|ИЗ
	|	Справочник.СтатусыЛида КАК СтатусыЛида
	|ГДЕ
	|	НЕ СтатусыЛида.ПометкаУдаления
	|	И СтатусыЛида.Предопределенный
	//#11332
	|	И НЕ СтатусыЛида.Ссылка = ЗНАЧЕНИЕ(Справочник.СтатусыЛида.УДАЛИТЬ_Сервис)
	|	И НЕ СтатусыЛида.Ссылка = ЗНАЧЕНИЕ(Справочник.СтатусыЛида.УДАЛИТЬ_Рекламация)
	|
	|УПОРЯДОЧИТЬ ПО
	|	СтатусыЛида.РеквизитДопУпорядочивания";
		
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ИмяКоманды = "ЗаполнитьДляСтатуса" + Выборка.Имя;
		НоваяКоманда = Команды.Добавить(ИмяКоманды);
		НоваяКоманда.Действие   = "ЗаполнитьПоУмолчанию";
		НоваяКоманда.Заголовок  = "Для статуса """ + Выборка.Статус + """";	
		НовыйЭлемент = Элементы.Добавить("Форма" + ИмяКоманды, Тип("КнопкаФормы"), Элементы.ФормаГруппаЗаполнить);
		НовыйЭлемент.ИмяКоманды = ИмяКоманды;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоУмолчанию(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтотОбъект, Команда.Имя);
    ПоказатьВопрос(Оповещение, "Текущие настройки будут утеряны. Продолжить?", РежимДиалогаВопрос.ДаНет);    
 
КонецПроцедуры
 
&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, ДополнительныеПараметры) Экспорт
 
	Если Результат = КодВозвратаДиалога.Да Тогда
		ИмяСтатусаСтрокой = ?(ДополнительныеПараметры = "ЗаполнитьПоУмолчанию", "", СтрЗаменить(ДополнительныеПараметры, "ЗаполнитьДляСтатуса", "")); 
    	ЗаполнитьНастройкиПоУмолчанию(Истина, ИмяСтатусаСтрокой);    
	КонецЕсли;
	ПодключитьОбработчикОжидания("ТаблицаТекущихСтатусовПриАктивизацииСтрокиОбработчикОжидания", 0.1, Истина);
 
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНастройкиПоУмолчанию(Перезаполнить, ИмяТекущегоСтатусаСтрокой)

	РегистрыСведений.ПорядокПереводаСтатусаЛида.ЗаполнитьНастройкиПоУмолчанию(Перезаполнить, ИмяТекущегоСтатусаСтрокой);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаСледующихСтатусовРазрешеноПриИзменении(Элемент)
	
	ТекущиеДанныеТС = Элементы.ТаблицаТекущихСтатусов.ТекущиеДанные;
	Если ТекущиеДанныеТС = Неопределено ТОгда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанныеСС = Элементы.ТаблицаСледующихСтатусов.ТекущиеДанные;
	Если ТекущиеДанныеСС = Неопределено ТОгда
		Возврат;
	КонецЕсли;
	
	ТаблицаСледующихСтатусовРазрешеноПриИзмененииНаСервере(ТекущиеДанныеТС.ТекущийСтатус, ТекущиеДанныеСС.СледующийСтатус, ТекущиеДанныеСС.Разрешено);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ТаблицаСледующихСтатусовРазрешеноПриИзмененииНаСервере(ТекущийСтатус, СледующийСтатус, Разрешено)
	
	РегистрыСведений.ПорядокПереводаСтатусаЛида.ДобавитьОбновитьЗапись(ТекущийСтатус, СледующийСтатус, Разрешено, Истина);
	
КонецПроцедуры

#Область ОбработчикиКомандФормы


#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

// #16875
&НаКлиенте
Процедура ТаблицаТекущихСтатусовИспользоватьПриИзменении(Элемент)
	
	ОчиститьСообщения();
	
	ТекущиеДанные = Элементы.ТаблицаТекущихСтатусов.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;	
	КонецЕсли;
		
	Если НЕ ИзменитьПризнакИспользоватьНаСервере(ТекущиеДанные.ТекущийСтатус) Тогда				
		ТекущиеДанные.Использовать = НЕ ТекущиеДанные.Использовать;
	КонецЕсли;
	
	Если НЕ ТекущиеДанные.Использовать Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ОтключитьИспользованиеСтатусаЗавершение", ЭтотОбъект, ТекущиеДанные.ТекущийСтатус);
		ПоказатьВопрос(ОписаниеОповещения, "Отключить переходы статуса и переходы на выбранный статус?", РежимДиалогаВопрос.ДаНет);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОтключитьИспользованиеСтатусаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ОтключитьИспользованиеСтатусаСервер(ДополнительныеПараметры);
		
		ПодключитьОбработчикОжидания("ТаблицаТекущихСтатусовПриАктивизацииСтрокиОбработчикОжидания", 0.1, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОтключитьИспользованиеСтатусаСервер(Статус) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Статус", Статус);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеРегистра.ТекущийСтатус КАК ТекущийСтатус,
	|	ДанныеРегистра.СледующийСтатус КАК СледующийСтатус
	|ИЗ
	|	РегистрСведений.ПорядокПереводаСтатусаЛида КАК ДанныеРегистра
	|ГДЕ
	|	ДанныеРегистра.Разрешено
	|	И (ДанныеРегистра.ТекущийСтатус = &Статус
	|			ИЛИ ДанныеРегистра.СледующийСтатус = &Статус)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		МенеджерЗаписи = РегистрыСведений.ПорядокПереводаСтатусаЛида.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ТекущийСтатус 	= Выборка.ТекущийСтатус; 
		МенеджерЗаписи.СледующийСтатус 	= Выборка.СледующийСтатус; 
		МенеджерЗаписи.Разрешено 		= Ложь;
		МенеджерЗаписи.Записать(Истина);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	// оформление строки 
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаТекущихСтатусов.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТаблицаТекущихСтатусов.Использовать");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);
	
	// оформление строки 
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаСледующихСтатусов.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТаблицаСледующихСтатусов.Использовать");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);

	
КонецПроцедуры

&НаСервере
Функция ИзменитьПризнакИспользоватьНаСервере(ТекущийСтатус)
	
	СпрОбъект = ТекущийСтатус.ПолучитьОбъект(); 
	СпрОбъект.Использовать = НЕ СпрОбъект.Использовать;
	Попытка
		СпрОбъект.Записать();
		Возврат Истина;
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
	
	Возврат Ложь;
	
КонецФункции

#КонецОбласти
